---
kind: method
id: M:Autodesk.Revit.DB.Frame.Transform(Autodesk.Revit.DB.Transform)
zh: 变换
source: html/50ef89f7-1c5b-46ad-a33d-911b6834f8e6.htm
---
# Autodesk.Revit.DB.Frame.Transform Method

**中文**: 变换

Applies the input transform to this frame.

## Syntax (C#)
```csharp
public void Transform(
	Transform trf
)
```

## Parameters
- **trf** (`Autodesk.Revit.DB.Transform`) - The transform to apply to the frame.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null
- **Autodesk.Revit.Exceptions.InvalidOperationException** - this operation failed.